[1,["ecpdLyjvZBwrvm+cedCcQy"],["node","scene","_parent"],[["cc.Node",["_name","_id","_components","_contentSize","_trs","_parent","_children","_color"],1,9,5,7,1,2,5],["cc.SceneAsset",["_name","asyncLoadAssets"],1],["cc.Scene",["_name","_children","_anchorPoint","_trs"],2,2,5,7],["cc.Camera",["_clearFlags","_depth","node"],1,1],["cc.Label",["_string","_fontSize","_lineHeight","_N$verticalAlign","_N$overflow","node","_materials"],-2,1,3],["cc.Canvas",["node","_designResolution"],3,1,5],["cc.Widget",["_alignFlags","node"],2,1]],[[1,0,1,3],[2,0,1,2,3,2],[0,0,1,6,2,3,4,3],[0,0,5,2,3,2],[0,0,5,2,7,3,4,2],[3,0,1,2,3],[4,0,1,2,3,4,5,6,6],[5,0,1,1],[6,0,1,2]],[[0,"New Scene",null],[2,"Canvas","a5esZu+45LA5mBpvttspPD",[-3,-4],[[7,-1,[5,1280,720]],[8,45,-2]],[5,1280,720],[640,360,0,0,0,0,1,1,1,1]],[1,"New Node",[1],[0,0,0],[0,0,0,0,0,0,1,1,1,1]],[3,"Main Camera",1,[[5,7,-1,-5]],[5,960,640]],[4,"New Label",1,[[6,"This privacy policy has been compiled to better serve those who are concerned with how their ‘Personally Identifiable Information’ (PII) is being used online. PII, as described in US privacy law and information security, is information that can be used on its own or with other information to identify, contact, or locate a single person, or to identify an individual in context. Please read our privacy policy carefully to get a clear understanding of how we collect, use, protect or otherwise handle your Personally Identifiable Information in accordance with our website.\n\nWhat personal information do we collect from the people that visit our blog, website or app?\nWhen ordering or registering on our site, as appropriate, you may be asked to enter your name, email address or other details to help you with your experience.\n\nWhen do we collect information?\nWe collect information from you when you or enter information on our site.\nProvide us with feedback on our products or services Use Game Leaderboard\n\nHow do we use your information?\n\nHow do we protect your information?\nWe do not use vulnerability scanning and/or scanning to PCI standards.\nAn external PCI compliant payment gateway handles all CC transactions.\nWe use regular Malware Scanning.\n\nYour personal information is contained behind secured networks and is only accessible by a limited number of persons who have special access rights to such systems, and are required to keep the information confidential. In addition, all sensitive/credit information you supply is encrypted via Secure Socket Layer (SSL) technology.\n\nWe implement a variety of security measures when a user enters, submits, or accesses their information to maintain the safety of your personal information.\n\nAll transactions are processed through a gateway provider and are not stored or processed on our servers.\n\nDo we use ‘cookies’?\nWe do not use cookies for tracking purposes\nYou can choose to have your computer warn you each time a cookie is being sent, or you can choose to turn off all cookies. You do this through your browser settings. Since browser is a little different, look at your browser’s Help Menu to learn the correct way to modify your cookies.\n\nIf you turn cookies off, Some of the features that make your site experience more efficient may not function properly.that make your site experience more efficient and may not function properly.\n\nThird-party disclosure\nWe do not sell, trade, or otherwise transfer to outside parties your Personally Identifiable Information.\n\nThird-party links\nOccasionally, at our discretion, we may include or offer third-party products or services on our website. These third-party sites have separate and independent privacy policies. We therefore have no responsibility or liability for the content and activities of these linked sites. Nonetheless, we seek to protect the integrity of our site and welcome any feedback about these sites.\n\nWe use Google AdSense Advertising on our website.\nGoogle, as a third-party vendor, uses cookies to serve ads on our site. Google’s use of the DART cookie enables it to serve ads to our users based on previous visits to our site and other sites on the Internet. Users may opt-out of the use of the DART cookie by visiting the Google Ad and Content Network privacy policy.\n\nOpting out:\nUsers can set preferences for how Google advertises to you using the Google Ad Settings page. Alternatively, you can opt out by visiting the Network Advertising Initiative Opt Out page or by using the Google Analytics Opt Out Browser add on.\n\nCalifornia Online Privacy Protection Act\nCalOPPA is the first state law in the nation to require commercial websites and online services to post a privacy policy. The law’s reach stretches well beyond California to require any person or company in the United States (and conceivably the world) that operates websites collecting Personally Identifiable Information from California consumers to post a conspicuous privacy policy on its website stating exactly the information being collected and those individuals or companies with whom it is being shared.\nAccording to CalOPPA, we agree to the following:\nUsers can visit our site anonymously.\nOnce this privacy policy is created, we will add a link to it on our home page or as a minimum, on the first significant page after entering our website.\nOur Privacy Policy link includes the word ‘Privacy’ and can easily be found on the page specified above.\n\nHow does our site handle Do Not Track signals?\nWe honor Do Not Track signals and Do Not Track, plant cookies, or use advertising when a Do Not Track (DNT) browser mechanism is in place.\nDoes our site allow third-party behavioral tracking?\nIt’s also important to note that we allow third-party behavioral tracking\n\nCAN SPAM Act\nThe CAN-SPAM Act is a law that sets the rules for commercial email, establishes requirements for commercial messages, gives recipients the right to have emails stopped from being sent to them, and spells out tough penalties for violations.",14,14,1,3,-6,[0]]],[4,4278190080],[5,1249,899.6400000000001],[0,-110,0,0,0,0,1,1,1,1]]],0,[0,0,1,0,0,1,0,-1,3,0,-2,4,0,0,3,0,0,4,0,1,2,1,2,2,6],[0],[-1],[0]]